app/Controllers/AsesmenController.php

SELECT `asesmen`.*, `kunjungan`.`jeniskunjungan`, `kunjungan`.`tglkunjungan`, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `asesmen`
JOIN `kunjungan` ON `kunjungan`.`id` = `asesmen`.`kunjunganid`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
---
    public function datatable()
    {

        $builder = $this->asesmenModel->builder();
        $builder->select('asesmen.*, kunjungan.jeniskunjungan, kunjungan.tglkunjungan, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                ->join('kunjungan', 'kunjungan.id = asesmen.kunjunganid')
                ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid');

        $data = $builder->get()->getResultArray();

SELECT `kunjungan`.`id`, `kunjungan`.`jeniskunjungan`, `kunjungan`.`tglkunjungan`, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `kunjungan`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
ORDER BY `kunjungan`.`tglkunjungan` DESC
---
    public function getKunjunganList()
    {
        $kunjungan = $this->kunjunganModel->select('kunjungan.id, kunjungan.jeniskunjungan, kunjungan.tglkunjungan, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                                          ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                                          ->join('pasien', 'pasien.id = pendaftaran.pasienid')
                                          ->orderBy('kunjungan.tglkunjungan', 'DESC')
                                          ->findAll();