app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'perawat'
OR `email` = 'perawat'
 LIMIT 1
UPDATE `users` SET `last_login` = '2026-02-08 14:40:01', `updated_at` = '2026-02-08 14:40:01'
WHERE `users`.`id` IN ('3')
---
    public function attemptLogin()
    {
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan username atau email
        $user = $userModel->where('username', $username)
                         ->orWhere('email', $username)
                         ->first();

        if ($user) {
            // Verifikasi password
            if (password_verify($password, $user['password'])) {
                // Cek apakah user aktif
                if ($user['is_active'] == 1) {
                    // Update last login
                    $userModel->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);