app/Controllers/DiagnosaController.php

SELECT `asesmen`.*, `kunjungan`.`jeniskunjungan`, `kunjungan`.`tglkunjungan`, `pasien`.`nama`, `pasien`.`norm`, `pendaftaran`.`noregistrasi`
FROM `asesmen`
JOIN `kunjungan` ON `kunjungan`.`id` = `asesmen`.`kunjunganid`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
---
    public function index()
    {
        // Get asesmen with related data for modal dropdown
        $data['asesmen'] = $this->asesmenModel
            ->select('asesmen.*, kunjungan.jeniskunjungan, kunjungan.tglkunjungan, pasien.nama, pasien.norm, pendaftaran.noregistrasi')
            ->join('kunjungan', 'kunjungan.id = asesmen.kunjunganid')
            ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
            ->join('pasien', 'pasien.id = pendaftaran.pasienid')
            ->findAll();

SELECT `diagnosa`.*, `pasien`.`nama`, `pasien`.`norm`
FROM `diagnosa`
JOIN `asesmen` ON `asesmen`.`id` = `diagnosa`.`asesmenid`
JOIN `kunjungan` ON `kunjungan`.`id` = `asesmen`.`kunjunganid`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
---
    public function datatable()
    {
        $request = $this->request->getPost();





        // Query builder with joins
        $builder = $this->diagnosaModel->builder();
        $builder->select('diagnosa.*, pasien.nama, pasien.norm')
                ->join('asesmen', 'asesmen.id = diagnosa.asesmenid')
                ->join('kunjungan', 'kunjungan.id = asesmen.kunjunganid')
                ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid');


        // Get data
        $data = $builder
                       ->get()
                       ->getResultArray();

SELECT `asesmen`.`id`, `asesmen`.`keluhan_utama`, `kunjungan`.`jeniskunjungan`, `kunjungan`.`tglkunjungan`, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `asesmen`
JOIN `kunjungan` ON `kunjungan`.`id` = `asesmen`.`kunjunganid`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
ORDER BY `asesmen`.`created_at` DESC
---
    public function getAsesmenList()
    {
        $asesmen = $this->asesmenModel->select('asesmen.id, asesmen.keluhan_utama, kunjungan.jeniskunjungan, kunjungan.tglkunjungan, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                                      ->join('kunjungan', 'kunjungan.id = asesmen.kunjunganid')
                                      ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                                      ->join('pasien', 'pasien.id = pendaftaran.pasienid')
                                      ->orderBy('asesmen.created_at', 'DESC')
                                      ->findAll();