app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `pendaftaran`
SELECT COUNT(*) AS `numrows` FROM `kunjungan`
SELECT COUNT(*) AS `numrows` FROM `asesmen`
SELECT COUNT(*) AS `numrows` FROM `diagnosa`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `pasien`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `pendaftaran`.*, `pasien`.`nama`, `pasien`.`norm`
FROM `pendaftaran`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
ORDER BY `pendaftaran`.`created_at` DESC
 LIMIT 5
SELECT `kunjungan`.*, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `kunjungan`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
ORDER BY `kunjungan`.`created_at` DESC
 LIMIT 5
---
    public function index(): string
    {
        // Get statistics
        $pasienModel = new PasienModel();
        $pendaftaranModel = new PendaftaranModel();
        $kunjunganModel = new KunjunganModel();
        $asesmenModel = new AsesmenModel();
        $diagnosaModel = new DiagnosaModel();
        $userModel = new UserModel();

        $data = [
            'total_pasien' => $pasienModel->countAll(),
            'total_pendaftaran' => $pendaftaranModel->countAll(),
            'total_kunjungan' => $kunjunganModel->countAll(),
            'total_asesmen' => $asesmenModel->countAll(),
            'total_diagnosa' => $diagnosaModel->countAll(),
            'total_users' => $userModel->countAll(),

            // Get recent data
            'recent_pasien' => $pasienModel->orderBy('created_at', 'DESC')->limit(5)->findAll(),
            'recent_pendaftaran' => $pendaftaranModel
                ->select('pendaftaran.*, pasien.nama, pasien.norm')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid')
                ->orderBy('pendaftaran.created_at', 'DESC')
                ->limit(5)
                ->findAll(),
            'recent_kunjungan' => $kunjunganModel
                ->select('kunjungan.*, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid')
                ->orderBy('kunjungan.created_at', 'DESC')
                ->limit(5)
                ->findAll(),