app/Controllers/KunjunganController.php

SELECT `kunjungan`.*, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `kunjungan`
JOIN `pendaftaran` ON `pendaftaran`.`id` = `kunjungan`.`pendaftaranpasienid`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
---
    public function datatable()
    {
        $request = $this->request->getPost();

        // Query builder with joins
        $builder = $this->kunjunganModel->builder();
        $builder->select('kunjungan.*, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                ->join('pendaftaran', 'pendaftaran.id = kunjungan.pendaftaranpasienid')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid');


        // Get data
        $data = $builder->get()
                       ->getResultArray();

SELECT `pendaftaran`.`id`, `pendaftaran`.`noregistrasi`, `pasien`.`nama`, `pasien`.`norm`
FROM `pendaftaran`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`
ORDER BY `pendaftaran`.`tglregistrasi` DESC
---
    public function getPendaftaranList()
    {
        $pendaftaran = $this->pendaftaranModel->select('pendaftaran.id, pendaftaran.noregistrasi, pasien.nama, pasien.norm')
                                              ->join('pasien', 'pasien.id = pendaftaran.pasienid')
                                              ->orderBy('pendaftaran.tglregistrasi', 'DESC')
                                              ->findAll();