app/Controllers/PasienController.php

    public function datatable()
    {
        $request = $this->request->getPost();




        // Query builder
        $builder = $this->pasienModel->builder();





        // Get data
        $data = $builder
                       ->get()
                       ->getResultArray();
---
SELECT *
FROM `pasien`