app/Controllers/PendaftaranController.php

    public function datatable()
    {
        $request = $this->request->getPost();

        // Query builder with join
        $builder = $this->pendaftaranModel->builder();
        $builder->select('pendaftaran.*, pasien.nama, pasien.norm')
                ->join('pasien', 'pasien.id = pendaftaran.pasienid');
        // Get data
        $data = $builder->get()
                       ->getResultArray();
---
SELECT `pendaftaran`.*, `pasien`.`nama`, `pasien`.`norm`
FROM `pendaftaran`
JOIN `pasien` ON `pasien`.`id` = `pendaftaran`.`pasienid`

    public function getPasienList()
    {
        $pasien = $this->pasienModel->select('id, norm, nama')->findAll();
---
SELECT `id`, `norm`, `nama`
FROM `pasien`