app/Controllers/UserController.php

    public function getRoles()
    {
        $roles = $this->roleModel->findAll();
---
SELECT *
FROM `roles`