app/Models/UserModel.php

    public function getUserWithRole($id)
    {
        return $this->select('users.*, roles.role_name, roles.description as role_description')
                    ->join('roles', 'roles.id = users.role_id')
                    ->where('users.id', $id)
                    ->first();
---
SELECT `users`.*, `roles`.`role_name`, `roles`.`description` as `role_description`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '3'
 LIMIT 1

    public function getAllUsersWithRole()
    {
        return $this->select('users.*, roles.role_name')
                    ->join('roles', 'roles.id = users.role_id')
                    ->findAll();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`